#+title: Networked weather monitoring station: Project diary

** IN-PROGRESS Design power supply
:LOGBOOK:
- State "IN-PROGRESS" from "TODO"       [2022-01-31 Mon 20:42] \\
  Defining power budget and choosing LDOs
:END:
Power budget
|-----------+------+-----------------------+-----------------------------------|
| Chip      | Vcc  | Max current draw (mA) | Note                              |
|-----------+------+-----------------------+-----------------------------------|
| ATmega328 | 5V   |                    15 | 16 MHz, no pins supplying current |
| W5500     | 3.3V |                   132 |                                   |
| BME250    | 3.3V |                     1 |                                   |
| TMP117    | 3.3V |                     0 | Negligible                        |
| AS5601    | 3.3V |                    10 | 100 mA if burning OTP             |
|-----------+------+-----------------------+-----------------------------------|
|           |      |                   158 |                                   |
|-----------+------+-----------------------+-----------------------------------|
#+TBLFM: @7$3=vsum(@2..@6)

Power over ethernet guides:
- [[https://www.freetronics.com.au/pages/power-over-ethernet-for-arduino][Freetronics article on POE for arduino]]

